read_verilog /home/jeronimo/GIT/PeR/benchmarks/fpga/IWLS93/5xp1.v
hierarchy -check -top top
synth -flatten
aigmap
write_aiger example.aig
#synth -top top
#abc -lut 4 -g all -dress
#abc -exe write_dot /home/jeronimo/GIT/PeR/benchmarks/fpga/#synth_verilog/t.dot
#
#
#show -format dot -prefix synthesized
#write_verilog synthesized.v

